#+title: Setting up emacs re-re-dux
#+subtitle: What is more fun that configuring emacs?
#+tags[]: emacs
#+date: 2023-06-06

Can we ever stop setting up emacs?  I don't think it's possible, no.
Lets do it again, with a nice clean setup using [[https://github.com/rougier/nano-emacs/tree/master][Nano Emacs]].

* Matching the system theme

Adapted from [[https://github.com/Lambda-Emacs/lambda-emacs/blob/ed060ac3a219ba053107724503a3e0ecf5ac3c4a/lambda-library/lambda-setup/lem-setup-theme.el#L81][Lambda Theme]].  We add a hook to
=ns-system-appearance-change-functions= and then make sure that we
toggle the nano theme based upon the current setting in
=ns-system-appearance=.

#+begin_src elisp :tangle ~/.emacs.d/init.el
  ;; See https://github.com/d12frosted/homebrew-emacs-plus#system-appearance-change
  (defun nano-sync-theme (appearance)
  "Sync the nano theme with the system theme"
  (if
   (string= nano-theme-var ns-system-appearance)
   (message "Theme is good")
   (nano-toggle-theme)))

  (when -is-a-mac
    (add-hook 'ns-system-appearance-change-functions #'nano-sync-theme))

#+end_src

#+RESULTS:
| nano-sync-theme |

